{ "unread_entries": [593529,593922,594111], "forced_entries": [], "entry_ratings": {"583614":1,"589596":1,"589994":1,"592294":1,"593002":1,"595169":1}, "participants": [{"id":13005,"display_name":"Nancy Nicole Meyer","avatar_image_url":"https://acue.instructure.com/images/messages/avatar-50.png","html_url":"https://acue.instructure.com/courses/1765/users/13005","pronouns":"She/Her","isInactive":false},{"id":13010,"display_name":"Ranjidha Rajan","avatar_image_url":"https://acue.instructure.com/images/thumbnails/872916/rF8VBzC6KXaxbj5WlIhlWyNZDVSFlUty5KbzEw9w","html_url":"https://acue.instructure.com/courses/1765/users/13010","pronouns":"She/Her","isInactive":false},{"id":32349,"display_name":"Natasha Bluhm","avatar_image_url":"https://acue.instructure.com/images/thumbnails/878024/6WB8LVzkCrjn4PoIKqxG33FcRw1tevBkj5j3w6uR","html_url":"https://acue.instructure.com/courses/1765/users/32349","pronouns":"She/Her","isInactive":false},{"id":32351,"display_name":"Mike Dally","avatar_image_url":"https://acue.instructure.com/images/thumbnails/886543/Qr8z18nQIy39oDWyQPTf1V6kc2oEQzYpaJ3BVXyG","html_url":"https://acue.instructure.com/courses/1765/users/32351","pronouns":"He/Him","isInactive":false},{"id":32353,"display_name":"Kevin Heupel","avatar_image_url":"https://acue.instructure.com/images/thumbnails/900846/GFfHUKazUqWD4ELHXvKyACPh2vktWvSggA1sBpzP","html_url":"https://acue.instructure.com/courses/1765/users/32353","pronouns":"He/Him","isInactive":false},{"id":32355,"display_name":"Scott Landolt","avatar_image_url":"https://acue.instructure.com/images/thumbnails/901254/B1meUxeXxkeiJjnlC4me3fQjAFayr7W690dibPT0","html_url":"https://acue.instructure.com/courses/1765/users/32355","pronouns":"He/Him","isInactive":false},{"id":32356,"display_name":"Carolyn McGary","avatar_image_url":"https://acue.instructure.com/images/thumbnails/877869/9Dy8GUcPpq8AgTn2BT6FmisVNuE203oeJ7ZIJ3iu","html_url":"https://acue.instructure.com/courses/1765/users/32356","pronouns":"She/Her","isInactive":false},{"id":32357,"display_name":"Jacyn Meyer","avatar_image_url":"https://acue.instructure.com/images/thumbnails/877957/rKmt87Tci7blYFDv4JTqMN3gG5KSzn7IbNCRm9em","html_url":"https://acue.instructure.com/courses/1765/users/32357","pronouns":"She/Her","isInactive":false},{"id":32359,"display_name":"Keri Olson","avatar_image_url":"https://acue.instructure.com/images/thumbnails/880269/4Fqsynt9iPVPHCjDfXEjNohxdpNHLpHNzS0hqPQt","html_url":"https://acue.instructure.com/courses/1765/users/32359","pronouns":null,"isInactive":false},{"id":32360,"display_name":"Marissa Orlowski","avatar_image_url":"https://acue.instructure.com/images/thumbnails/877930/dt1bxko1GXQmKzQmtynr7wZaxFBSDNClfeAYdYqA","html_url":"https://acue.instructure.com/courses/1765/users/32360","pronouns":"She/Her","isInactive":false},{"id":32361,"display_name":"Alycia Palmer","avatar_image_url":"https://acue.instructure.com/images/thumbnails/892042/LOvLcckhA2dUtb4JjB7ZIr50DaYs3NKV7dsKllrU","html_url":"https://acue.instructure.com/courses/1765/users/32361","pronouns":"She/Her","isInactive":false},{"id":32362,"display_name":"Tamantha Peters","avatar_image_url":"https://acue.instructure.com/images/thumbnails/885736/0s5TPkmfCpEVfrkDbsLbKv5LwX1Qq4V2rz1tCM0L","html_url":"https://acue.instructure.com/courses/1765/users/32362","pronouns":"She/Her","isInactive":false},{"id":32363,"display_name":"Ray Phillips","avatar_image_url":"https://acue.instructure.com/images/thumbnails/884139/oMYYbrfuezbixWMYqfJmmHb7ngdwWWJiphmDjKVW","html_url":"https://acue.instructure.com/courses/1765/users/32363","pronouns":null,"isInactive":false},{"id":32364,"display_name":"David Piacenti","avatar_image_url":"https://acue.instructure.com/images/thumbnails/877874/HoTcjBuWZW4kiKrnGJfH4kYHBPzrNgNldUivzTjp","html_url":"https://acue.instructure.com/courses/1765/users/32364","pronouns":null,"isInactive":false},{"id":32366,"display_name":"Courtney Rocheleau","avatar_image_url":"https://acue.instructure.com/images/thumbnails/877904/9jGiWZqk7ixM2449ShCG7KmuXcn5c9Tgz3d7Ee2L","html_url":"https://acue.instructure.com/courses/1765/users/32366","pronouns":"She/Her","isInactive":false},{"id":32371,"display_name":"Summer Trentin","avatar_image_url":"https://acue.instructure.com/images/thumbnails/900993/3ZMR8sV4XMDrwJTe7v0bmOdO1EOgMHvUWZjPbcCB","html_url":"https://acue.instructure.com/courses/1765/users/32371","pronouns":"She/Her","isInactive":false},{"id":32374,"display_name":"Parker Wilson","avatar_image_url":"https://acue.instructure.com/images/messages/avatar-50.png","html_url":"https://acue.instructure.com/courses/1765/users/32374","pronouns":"He/Him","isInactive":false},{"id":32375,"display_name":"Mark Yoss","avatar_image_url":"https://acue.instructure.com/images/thumbnails/901001/din18YMre7YBOyPG9XuSHzoPXVb7KqdgCZwrHCwq","html_url":"https://acue.instructure.com/courses/1765/users/32375","pronouns":"He/Him","isInactive":false},{"id":32376,"display_name":"Carter Zufelt","avatar_image_url":"https://acue.instructure.com/images/thumbnails/901181/HrgByUScLyi50ykyPPiXOHqPOiyrPyO2Dh01A24c","html_url":"https://acue.instructure.com/courses/1765/users/32376","pronouns":"He/Him","isInactive":false}], "view": [{"id":583614,"user_id":32374,"parent_id":null,"created_at":"2021-09-12T21:31:06Z","updated_at":"2021-09-12T21:31:06Z","rating_count":4,"rating_sum":4,"message":"\u003cp\u003eRobert did a good job of foreshadowing where the lecture was going to go, and used many logical transitions and signal words, but I think he could've left more time between each of his important points to allow for note-taking. Alternately, he could've repeated the list another time for clarification.\u003c/p\u003e\n\u003cp\u003eHe frequently gave examples of how to take better notes and to improve speed and organization, but he tended to do so after the students had already begun taking their notes. It may be more beneficial to have mentioned taking pen-and-paper notes / how to organize them / how to utilize shorthand before the lecture started.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eSkeletal notes are a great way to draw attention to those important points and provide a basis of organization for students. Anything that can reduce their cognitive load while allowing for more opportunities for successful encoding should be encouraged. If its absolutely important that the students get an exact definition or wording, I like to display that on my PPT slide in a different color to make it obvious what they should record on their outline.\u003c/p\u003e\n\u003cp\u003eI haven't taken the time in the middle of class to allow students to compare notes, but I think that's a really useful \"break\" and allows for more collaboration. When possible, I strive to correct any misunderstandings during the very same lecture and that technique seems to be a great way to allow the slower note-takers to catch up while also allowing the instructor to identify areas that the class as a whole may be struggling with, or a part of the lecture that could've been made more clear.\u003c/p\u003e\n\u003cp\u003eI hadn't considered giving my students an example of notetaking by literally handing them a copy of what I would've recorded during a previous lecture for comparison. I plan on incorporating that in the future, especially at the start of our program. Its a great way to show what is and isn't important. Giving them a tool to compare their note taking style early on in our program could greatly increase their understanding and retention as they progress in the rest of their coursework.\u003c/p\u003e"},{"id":584004,"user_id":13005,"parent_id":null,"created_at":"2021-09-13T02:41:56Z","updated_at":"2021-09-13T02:41:56Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eSince this isn't my field of expertise, I definitely felt like a lost student when Robert was lecturing in the first example. I was actually trying to write out my own notes as I listened because I find all these lectures interesting. However, I got as lost as the students, as I madly wrote, and listened. I enjoyed watching the student's eyes bug out and started whispering to their peers to figure out what was going on. Robert knows his material, that's for sure. He's good. The one thing I liked in his lecture was the handwritten outline he used on the board. I think the visuals help as he moved around the class and fluidly defined the concepts. The other thing I liked were the notes he provided from the previous week's lectures that he hadn't revealed were coming. That was a welcome surprise to everyone! Even though I didn't actually see the notes, it relieved the stress in the classroom, and I felt better about his teaching methodology. I enjoyed watching the two clips and thinking about how often I've seen both of these examples in my own classrooms. My biggest problem at times is that I used to assume my students had read the material assigned before attending class. It helps if they come with a bit of prior knowledge since there is so much material to cover in a relatively short time period, but most expect notes and other forms of personal assistance so I've changed my teaching styles over the years depending on whom I am teaching.\u003c/p\u003e"},{"id":585220,"user_id":32363,"parent_id":null,"created_at":"2021-09-14T17:14:36Z","updated_at":"2021-09-14T17:14:36Z","rating_count":3,"rating_sum":3,"message":"\u003cp\u003eThe students seemed to breathe a sigh of relief when the instructor introduced a lecture break. This break allowed the students to catch up with their note-taking and generated student-to-student interaction regarding the most critical aspects of the topic.\u003c/p\u003e\n\u003cp\u003eThe instructor referred to an incomplete learning objective from the prior week without providing a good segue into the topic. This learning objective could easily be incorporated into skeletal notes provided to the students at the start of the class.\u003c/p\u003e\n\u003cp\u003ePosting an outline of the topics related to the specific class and providing skeletal notes are essential. However, instructors must use their best judgment as to when lecture breaks are required. Therefore, I will incorporate all three techniques.\u003c/p\u003e","replies":[{"id":586195,"user_id":32364,"parent_id":585220,"created_at":"2021-09-15T20:31:07Z","updated_at":"2021-09-15T20:31:07Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eClearly the advance cues along with a slow and nuanced (non-verbally and with dramatic pauses) lecturing style created a slightly more advantageous pedagogical framework in the second \"re-enactment.\"\u0026nbsp; The binary opposition of the Banking Method that Paolo Freire critiques was called into question, but simply not resolved as the Socratic Method was just non-existent...\u0026nbsp; While I appreciate the Vygotskyian attempt of having the student bounce ideas off of each other, that too, was wanting\u0026nbsp; Providing visual cues to supplement the spoken lecture provided adequate time for the pupils to assimilate at least some of the material on an auditory level, then allowing sufficient time for tactile processing via note-taking.\u0026nbsp; The skeletal outline provided the bone from which the similar, but not precisely different notes would be taken by all students. As a note, I didn't find these videos to be realistic portrayals of even inexperienced instructors, nor the video from AL1 where the instructor rattled off stream of consciousness lines, one after another, without coming up for air.\u0026nbsp; Nevertheless, the point is taken.\u0026nbsp;\u003c/p\u003e"},{"id":587360,"user_id":32353,"parent_id":585220,"created_at":"2021-09-17T01:58:31Z","updated_at":"2021-09-17T01:58:31Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eI breathed a sign of relief as well as it was too much information in too short of a period of time.\u0026nbsp; The going back to a previous lecture was a good example of losing his students.\u0026nbsp; I think it's ok to go back, but take some time to set the stage and remind the students of the context first.\u003c/p\u003e","replies":[{"id":590002,"user_id":32362,"parent_id":587360,"created_at":"2021-09-20T00:20:24Z","updated_at":"2021-09-20T00:20:24Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eyou make a good point;\u0026nbsp; he needed to have a bit more organization ie: if forecasting was that important then he should have remembered to finish the lecture on it, or at least give the students supplemental material.\u0026nbsp; Being surprised in the middle of a lecture is difficult - it creates stress and confusion.\u003c/p\u003e"}]}]},{"id":587359,"user_id":32353,"parent_id":null,"created_at":"2021-09-17T01:56:43Z","updated_at":"2021-09-17T01:56:43Z","rating_count":4,"rating_sum":4,"message":"\u003cp\u003eRobert does a good job posting an outline, and that is about it.\u0026nbsp; Otherwise, he speaks to fast, provides conflicting advice about taking notes, and is dismissive to his students who are frustrated.\u0026nbsp; When Robert says there are three important concepts, he should take the time and write them on the board.\u0026nbsp; This will slow him down and give the students an idea about what is going to be discussed.\u0026nbsp; Robert needs to slow down and provide some more lecture breaks for students to compare notes.\u0026nbsp; They are writing so fast and falling behind that they are not obtaining any information. The students would be better off just reading the book chapter. Sorry Robert, but your lecture stressed me out and I have an accounting degree.\u003c/p\u003e","replies":[{"id":588215,"user_id":32371,"parent_id":587359,"created_at":"2021-09-17T22:22:36Z","updated_at":"2021-09-17T22:22:36Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eAgreed! The pacing of this and the instructor's somewhat brusque attitude and dismissive attitude toward students with questions triggered my anxiety.\u0026nbsp;\u003c/p\u003e"},{"id":593529,"user_id":32355,"parent_id":587359,"created_at":"2021-09-23T15:05:49Z","updated_at":"2021-09-23T15:05:49Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eCompletely agree. If the students aren't understanding the material, they are going to end up falling further and further behind as the lecture/classes progress. This ultimately ends up frustrating students and further inhibits their ability to learn the material\u003c/p\u003e"}]},{"id":588214,"editor_id":32371,"user_id":32371,"parent_id":null,"created_at":"2021-09-17T22:19:05Z","updated_at":"2021-09-17T22:21:08Z","rating_count":2,"rating_sum":2,"message":"\u003cp\u003eThe instructor effectively states why students should take notes, but doesn't (at first) give any helpful guidelines on how to do so effectively. He points out what is important, but speaks rather quickly. During his pause, he continues talking and gives additional information, so it would be tough to keep up and think.\u003c/p\u003e\n\u003cp\u003eI like that he asks students to pair up and comments on the discussion. He also encourages students to ask for clarification and gives a few tips. He seems almost bothered by the students asking him to slow down, though. As a student, I don't think I would feel comfortable asking this instructor for clarification or help.\u003c/p\u003e\n\u003cp\u003eNote-taking is something I really need to teach better; I realize I make a lot of assumptions about how and why students take notes. I do pay attention to students in order to provide sufficient time for note-taking, but I think I need to spend more time teaching effective note-taking skills.\u0026nbsp;\u003c/p\u003e","replies":[{"id":589351,"editor_id":32349,"user_id":32349,"parent_id":588214,"created_at":"2021-09-19T12:42:26Z","updated_at":"2021-09-19T12:43:46Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eSummer,\u003c/p\u003e\n\u003cp\u003eI agree, Robert's pace was too fast.\u0026nbsp; I, also, take for granted note-taking and that students may not have that skill set.\u0026nbsp; They may need to be taught.\u0026nbsp; I usually am a good note-taker, so I may assume my students are as well,\u0026nbsp; but I bet if I was in a class that had unfamiliar content, I would have a hard time knowing what was important too. I might take too many notes and miss out on actual learning.\u0026nbsp; I think the skeleton outline and having instructors highlight what is important would be needed.\u0026nbsp; \u0026nbsp;Thanks for sharing!\u003c/p\u003e\n\u003cp\u003eTasha Bluhm DNP\u0026nbsp;\u003c/p\u003e"}]},{"id":589350,"user_id":32349,"parent_id":null,"created_at":"2021-09-19T12:39:00Z","updated_at":"2021-09-19T12:39:00Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eHello Colleagues,\u003c/p\u003e\n\u003cp\u003eIf I was sitting in Robert's class, I would benefit from the skeleton outline of notes so that I would not have to write everything down.\u0026nbsp; This would give me a chance to understand where content goes and to connect that to learning.\u0026nbsp; I felt Robert spoke too quickly.\u0026nbsp; I would be so into my note-taking that I would not have time to do any learning in class.\u0026nbsp; I would be frustrated.\u0026nbsp; I think slowing the pacing down, providing the outline, and taking time to check in with classmates (which is a positive of how he set up his lecture) would be what I would need to learn in his class.\u003c/p\u003e\n\u003cp\u003eTasha Bluhm DNP\u003c/p\u003e","replies":[{"id":592998,"user_id":32366,"parent_id":589350,"created_at":"2021-09-22T21:04:41Z","updated_at":"2021-09-22T21:04:41Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eHe provided a lot of good information about note-taking, and was certainly more explicit and intentional about that information than I have ever been in my classes. I think there's a lot that I can take as a model from what is shown here. However, I agree that the delivery left something to be desired. I, too, would feel frustrated and anxious.\u003c/p\u003e\n\u003cp\u003eAs others have mentioned, writing some cues on the board would both help with pacing and would also benefit his students in identifying important points to capture in their notes and assist with organizing. He started off with a great outline of the material that would be covered in the first video, so I would know exactly how to organize the notes to begin, but if he'd then provided this outline on the board and listed major key points beneath each topic, it would have been helpful in keeping things straight.\u003c/p\u003e\n\u003cp\u003eSimilarly, when he returned to an earlier concept in the second video, it would have been extremely helpful to provide guidance about how and where the information fit in organizationally into the course material.\u003c/p\u003e"}]},{"id":589596,"user_id":32375,"parent_id":null,"created_at":"2021-09-19T18:20:49Z","updated_at":"2021-09-19T18:20:49Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eWith an opening of stressing the importance of taking good notes, Robert should have continued by distributing his skeletal outline and sharing note taking tips before launching in to the lecture.\u003c/p\u003e","replies":[{"id":593922,"user_id":32360,"parent_id":589596,"created_at":"2021-09-23T19:52:24Z","updated_at":"2021-09-23T19:52:24Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eI completely agree - \"disjointed\" was my comment!\u0026nbsp; Providing the students with a grounding in note-taking first, with the example notes, and then a skeletal outline for the planned content would have made much more sense.\u003c/p\u003e"}]},{"id":589994,"user_id":32362,"parent_id":null,"created_at":"2021-09-20T00:17:02Z","updated_at":"2021-09-20T00:17:02Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eThe technique that most benefits students, I think, is to provide complete lecture notes.\u0026nbsp; The topic is verbose with a lot of technical terms and it is important for the students to have clear definitions of the terms and how they all fit together.\u003c/p\u003e\n\u003cp\u003eOverall, I think Prof Robert goes very quickly - he uses a lot of nomenclature, defintions, and linkages that require a fairly deep understanding, certainly more than you can get in 10 seconds of spouting off definitions.\u0026nbsp; It might help if he wrote down, at minimum, the key terms on the board and how they relate to each other.\u0026nbsp; For example: Forecasting:\u0026nbsp; qualitative and quantitative.\u0026nbsp; At least the students would have something to follow.\u0026nbsp; Also, he seems a bit condescending to the students.\u0026nbsp; His intention is to definitely help them be better note takers but the execution needs some improvement.\u0026nbsp;\u0026nbsp;\u003c/p\u003e","replies":[{"id":592306,"user_id":32359,"parent_id":589994,"created_at":"2021-09-21T23:40:46Z","updated_at":"2021-09-21T23:40:46Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eI actually didn't mind his pace in video 1 and liked that he took a lecture break for the students to compare notes, but I could not follow his lecture. It was simply too much new information with very little context and lack of visuals. In video 2 he has a visual but never goes beyond slide one and the graph is overly complicated. Again, missing context. Even when he did suggest a term from a previous lecture that might have given context, he randomly added it to his lecture without explaining why. In the end the students had no idea where certain terms belonged in their notes. Context is so important. In order to organize our notes, we first need to be able to organize our thoughts.\u0026nbsp;\u003c/p\u003e"},{"id":594111,"user_id":32357,"parent_id":589994,"created_at":"2021-09-23T22:19:20Z","updated_at":"2021-09-23T22:19:20Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eI agree with you.\u0026nbsp; I know it is the only way I could take his class as he covers a lot of material and doesn't give enough context for me to understand it during the lecture.\u0026nbsp;\u0026nbsp;\u003c/p\u003e"}]},{"id":591957,"user_id":32361,"parent_id":null,"created_at":"2021-09-21T19:02:02Z","updated_at":"2021-09-21T19:02:02Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eRobert replies to the student's suggestion to slow down by saying that he has a lot of content to cover. He doesn't have any intention of slowing down, so I think that makes him obligated to help students be more efficient in their note taking. His outline was helpful, but then he didn't stick to it. And his typed notes from the previous lecture were welcome by the students, though it may have removed the incentive for them to take good notes in the future. So perhaps a good middle-ground would be for Robert to provide skeletal notes. This would help him as well because then he might not forget to cover a point. It was very disruptive when he had to change topics abruptly to cover missed content.\u003c/p\u003e","replies":[{"id":593002,"user_id":32366,"parent_id":591957,"created_at":"2021-09-22T21:09:37Z","updated_at":"2021-09-22T21:09:37Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eContent coverage rears its ugly head again. Speeding through some arbitrary amount of material so that we can check boxes and say we \"covered\" it, even though students walk away without any understanding of the material and without any ability to apply that information pretty much guarantees that they won't have any long-term retention or ability to use the material in their lives once they leave our classes. I want to \"ruin students for life\"--I want my classes to change them and have some type of lasting impact on them, and that means emphasizing depth over breadth. I talk fast, and I talk faster the more excited I get. And I get really excited and nerd out over Psychology. So this is something I really have to monitor when I teach. If our students don't have time to process, then we're not teaching, we're performing.\u003c/p\u003e"}]},{"id":592294,"user_id":32359,"parent_id":null,"created_at":"2021-09-21T23:34:04Z","updated_at":"2021-09-21T23:34:04Z","rating_count":2,"rating_sum":2,"message":"\u003cp\u003eRobert seems to really know his material and sometimes that can cause a barrier in teaching because while the content is all there the delivery is mismatched and difficult to follow. In both videos, Robert jumps from one topic to the next without transition. He mentions a subject from a previous lecture as an after thought that only confuses his students. When I feel a topic isn't covered well or is used again, I will start with that topic at the top of class and use it as a transition to the new material. Its worth taking 5 minutes to cover something again before introducing new ideas. In video one he fails to use visuals which are crucial to solidifying ideas because they make the terms more relatable. I liked that he passed out note outlines and gave tips on note taking but why in the middle of his lecture or to just a few individuals?\u0026nbsp; There was a cohesiveness missing to his approach. If you are going to use an outline, I believe the lecture should also follow that format. Presenting information out of order only leads to confusion.\u0026nbsp;\u003c/p\u003e"},{"id":593341,"user_id":13010,"parent_id":null,"created_at":"2021-09-23T04:51:23Z","updated_at":"2021-09-23T04:51:23Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003e\u003cspan\u003eI see a great discussion here, thank you all for your contributions. I agree about the note outline, In the first video -\u0026nbsp; I think there was an opportunity to use the whiteboard and \u0026amp; put up an outline of the lecture/points - for students to follow.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e"},{"id":593918,"user_id":32360,"parent_id":null,"created_at":"2021-09-23T19:50:19Z","updated_at":"2021-09-23T19:50:19Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eThe fact that Robert addressed note-taking and note-taking skills is honestly more than I have ever done.\u0026nbsp; In my own classes, I use logical transitions and signal words - I build transitions into my PPT decks and will put key concepts/terms in bold or different colors to make them very visually as well as verbally evident.\u0026nbsp; A critically important concept or definition gets it own slide, even if its only one sentence, and I will say things like \"you will want to write this down\" or \"This is important\".\u0026nbsp; But, I have never specifically talked about note-taking or how to take notes.\u003c/p\u003e\n\u003cp\u003eWhere I think Robert could have improved was in the flow.\u0026nbsp; I found both sessions to be disjointed because he bounced between the focal content and then a mini-session on notetaking.\u0026nbsp; In the first video, when the 2 students were confused and talking to each other, it also almost felt like he was scolding them for poor skills rather than coaching them (although I don't believe that was the intent)\u003c/p\u003e\n\u003cp\u003e[While not really relevant to the specific topics at hand...there was something about Robert's delivery that reminded me so much of Ben Stein in Ferris Bueller's Day Off that I kept waiting for him to say \"anyone, anyone\" or start talking about voodoo economics :-)\u0026nbsp; Don't know if anyone else had the same experience.]\u003c/p\u003e"},{"id":594108,"user_id":32357,"parent_id":null,"created_at":"2021-09-23T22:17:14Z","updated_at":"2021-09-23T22:17:14Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eRobert knows his subject, and I applaud his making his notes available to his students so they can understand the material better.\u0026nbsp; There are a few things Robert can do to improve the learning environment for his students:\u0026nbsp; 1) in his breakeven discussion, he could use an actual real-world example like a hotel and how many rooms they have to sell in a year to breakeven;\u0026nbsp; 2) Robert could provide his students with an outline of what he is going to cover for the class and start with any subject he missed the previous week so his students can connect the dots better, and 3) get better at reading the non-verbal cues from his students.\u0026nbsp; I don't think Robert understands that his tone is causing his students to shut down and less likely to ask questions and learn what he hopes they will.\u0026nbsp;\u0026nbsp;\u003c/p\u003e","replies":[{"id":594695,"user_id":32376,"parent_id":594108,"created_at":"2021-09-24T16:28:55Z","updated_at":"2021-09-24T16:28:55Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eI agree with all three of your points, Jacyn, but point 3 especially resonates with me. He would benefit greatly from listening to what his students are saying. Several times he seemed to breeze over what a student was asking, and you could tell it left the student feeling even more unsure.\u003c/p\u003e","replies":[{"id":595177,"user_id":32356,"parent_id":594695,"created_at":"2021-09-24T22:55:25Z","updated_at":"2021-09-24T22:55:25Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eI'm also in agreement with #3 - they'd ask him for something and it felt like he'd always have an excuse to do it his way anyway, which left many frustrated.\u0026nbsp;\u0026nbsp;\u003c/p\u003e"}]}]},{"id":594690,"user_id":32376,"parent_id":null,"created_at":"2021-09-24T16:22:35Z","updated_at":"2021-09-24T16:22:35Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eRobert began the lecture nicely by reminding the students of the benefits of note taking. The students seemed engaged and willing to participate as they all reached for their paper and pens.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI wish Robert would've began with a recap of last lesson's material, rather than bring it up in the middle of the current lesson. This seemed to confuse several students. It was clear Robert had a good understanding of the material. In general, he and the students would've benefited from simply slowing down and allowing the students to internalize the information as they're writing it down.\u003c/p\u003e\n\u003cp\u003eI have found that when given the time to think about what they are writing (rather than just writing what they hear) the students tend to retain that information more effectively. And it makes for more understandable notes if they need to review them in the future. I have also found that this is hard to do! Especially when you have a lot of material to cover, but again, it is important.\u003c/p\u003e","replies":[{"id":594873,"user_id":32351,"parent_id":594690,"created_at":"2021-09-24T18:54:11Z","updated_at":"2021-09-24T18:54:11Z","rating_count":null,"rating_sum":null,"message":"\u003cp\u003eCarter, I agree that the recap would have been helpful to review what he had not yet finished from the previous class and when he gave the outline of the plan for that day's class a review would have been appropriate at that time. One thing he did say, that I often feel, is that there is a \"lot of material to cover\".\u0026nbsp; Just as he is encouraging the students to focus on the important, I know I have to remind myself at times to focus on the more important aspects of the topic and not just deluge the students with all the information.\u003c/p\u003e"}]},{"id":594872,"user_id":32351,"parent_id":null,"created_at":"2021-09-24T18:50:38Z","updated_at":"2021-09-24T18:50:38Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eI feel that all the techniques that Robert used can be helpful to the students, posting an outline, giving breaks in the lecture, and providing complete notes, the problems came with how he utilized them. Again good ideas, but the tone of his comments during the lecture breaks did come across as if the students were not doing a good job on note-taking while excusing himself for areas where he could have improved. In the last video, he commented, in looking at a student's computer screen that his note seemed unorganized so maybe he should take notes by hand the rest of the class. Yet the rest of the class expressed frustration with trying to figure out how \"forecasting\", which was not in the notes for the day and was from the previous day's topic (unfinished). He discussed the value of defining the terms that were used, yet didn't define the terms for the students as he explained the graph he drew that confused the students.\u003c/p\u003e\n\u003cp\u003eI felt like this was an example of using good tools but not leveraging them the best way to assist the students.\u003c/p\u003e\n\u003cp\u003eI like the ideas and will plan on implementing some of these to see which work best for my classes and for me, but I think it's important that I also try to utilize the tools to provide the best impact.\u003c/p\u003e"},{"id":595169,"user_id":32356,"parent_id":null,"created_at":"2021-09-24T22:52:25Z","updated_at":"2021-09-24T22:52:25Z","rating_count":1,"rating_sum":1,"message":"\u003cp\u003eOk I'm responding here before reading others' thoughts.\u0026nbsp; I wrote a lot down.\u0026nbsp; ;-p\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eLikes:\u0026nbsp;\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eI like that he reminds them to take notes and the importance of it.\u0026nbsp;\u003c/li\u003e\n\u003cli\u003eHe gave them time to also discuss notes with fellow students for learner-learner interaction.\u0026nbsp;\u003c/li\u003e\n\u003cli\u003eHe also provided an example of his own notes for students to compare to in order to encourage good note taking techniques.\u0026nbsp;\u003c/li\u003e\n\u003cli\u003eHis outline in the second video to help students organize the data was good.\u0026nbsp;\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNeeds Improvement:\u0026nbsp;\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHe lists important topics on his fingers instead of on the board, which would facilitate students being able to keep up with the concepts as they're writing.\u0026nbsp;\u003c/li\u003e\n\u003cli\u003eDuring a reflection time, he overheard two students' confusion and helped correct them, but it would've been a great time to ensure the entire class heard the clarification as well.\u0026nbsp; In addition he went a bit into a note-taking lecture - again would've been a great learning moment for the class.\u0026nbsp;\u003c/li\u003e\n\u003cli\u003eIn the second video, he clearly outlined what they'd talk about, then almost immediately abandoned it for a discussion on a missed topic from the previous week, which the students were wholly unprepared for.\u0026nbsp; His comment to one student saying his notes were 'unorganized' was actually a result of his disorganization in presenting the information.\u0026nbsp; It would've helped if he said, before you write this down as this is the topic for today, I want to quickly introduce something we missed last week, which will help you in understanding this new concept.\u0026nbsp;\u0026nbsp;\u003c/li\u003e\n\u003c/ul\u003e"}], "new_entries": [] }